const data = [["על פי איזו הלכה שנקבעה בבית המשפט העליון מוגדרת ירידת ערך כנזק ישיר ולא כנזק תוצאתי?", "הלכת ”מוריאנו\"."], ["לפי הוראות חוק חוזה הביטוח, השתמ\"א-1981, באיזה מקרה נדרש מבוטח לנקוט באמצעים סבירים למניעת מקרה ביטוח, גם ללא הוראה מפורשת של המבטח?", "בקרות מקרה ביטוח ולאחר מכן"], ["חוק הפיקוח על שירותים פיננסים (ביטוח), התשמ\"א 1981...", "רשאי להתלות רישיון עד 30 יום ועוד 30 לאחר שמיעת טענות."], ["בהתאם להוראות חוזר ביטוח 2015-1-27...", "כאשר מחיר כתב שירות מוצג בנפרד."], ["על איזה ביטוח לא חל חוק חוזה הביטוח?", "ביטוח משנה"], ["כמה זמן לשלם דמי ביטוח במזומן?", "28 יום מתחילת הביטוח"], ["מתי חייבת זיקת ביטוח להתקיים בביטוחי אש?", "בעת קרות נזק."], ["מה הגיל שמגדיר אזרח ותיק?", "67"], ["מתי תשובה לא מלאה משפיעה?", "רק בעניין מהותי שהמבוטח ידע עליו."], ["איזה מונח מופיע בחוק חוזה הביטוח?", "הצעת ביטוח"], ["מה אינו חורג מעקרון השיפוי?", "תשלום נזק תוצאתי"], ["כיצד מוגדר רכב מנועי?", "כמשמעותו בחוק הפיצויים."], ["בסיס הגשת תביעה / קרות אירוע", "אחריות מקצועית / חבות מעבידים"], ["באיזה פוליסה ניתן לבטח מלחמה?", "באף פוליסה."], ["מי זכאי לתגמולי תאונות בביטוח לאומי?", "18–פרישה"], ["האם למבטח זכות תחלוף לפני תשלום?", "לא"], ["התיישנות מוצרים פגומים", "3 שנים ו-10 שנים משחרור המוצר"], ["הוצאות להקטנת נזק בערך מוסכם", "אין"], ["כיסוי טרור", "כן"], ["ביטוח חובה מכסה?", "נזקי גוף מתאונת דרכים בלבד"], ["משך התמחות מקסימלי", "3 שנים"], ["עמלת סוכן בחוק", "דמי עמילות"], ["משמעות נזק ראשון", "כיסוי עד סכום ללא ביטוח חסר"], ["תאונות אישיות", "פיצוי – ניתן לתבוע כפל"], ["גיל מינימלי לסוכן", "18"], ["פוליסה מסולקת", "הופסקו פרמיות ולא נפדה"], ["בפס\"ד סלוצקי הוזכר", "אמצעי מיגון"], ["לא ניתן לתבוע קטין", "מתחת 12"], ["הכשרה לנציג וותיקים", "3 שעות + ריענון שנתי"], ["מתי לא שולחים פוליסה?", "כשנהוג לא להוציא אותה"]];

const container = document.getElementById('cards');

data.forEach(([q,a])=>{
  const c=document.createElement('div');
  c.className='card';
  c.innerHTML = `<div class='q'><b>${q}</b></div><div class='answer'>${a}</div>`;
  c.onclick=()=>{ 
    const ans=c.querySelector('.answer'); 
    ans.style.display = ans.style.display==='none'?'block':'none';
  };
  container.appendChild(c);
});
